src/Reports/НаличиеКомплектацииНаЛинейках/НаличиеКомплектацииНаЛинейках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>НаличиеКомплектацииНаЛинейках</name>
  <attributes>
    <name>ИнтервалОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЯчейкиКомплектации/ЯчейкиКомплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЯчейкиКомплектации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоЯчеек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВЯчейке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГруппаРасчёта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыМПЗ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>EnumRef.СтатусыМПЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ПередачиВПроизводство/ПередачиВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиВПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/Себестоимость/Себестоимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Себестоимость</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ЗарплатнаяЧасть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьПолная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМПЗ</name>
  <enumValues>
    <name>Основная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Неликвид</name>
  </enumValues>
  <enumValues>
    <name>ПроблеммыЛогистики</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыСпецификаций/СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСпецификаций</name>
  <enumValues>
    <name>Серийная</name>
  </enumValues>
  <enumValues>
    <name>Предсерийная</name>
  </enumValues>
  <enumValues>
    <name>Опытная1</name>
  </enumValues>
  <enumValues>
    <name>Опытная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/Reports/НаличиеКомплектацииНаЛинейках/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМестоХранения = Макет.ПолучитьОбласть("МестоХранения");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблМПЗ_МенееПоловины = Макет.ПолучитьОбласть("МПЗ_МенееПоловины");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = ТекущаяДата();
ОблШапка.Параметры.Подразделения = СписокПодразделений;
ТабДок.Вывести(ОблШапка);

	Если ВидМПЗ = 1 Тогда
	ВыбВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
	Иначе
	ВыбВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
	КонецЕсли;	

Запрос = Новый Запрос;
СписокСтатусов = Новый СписокЗначений;

СписокСтатусов.Добавить(Перечисления.СтатусыМПЗ.Запрещённая);
СписокСтатусов.Добавить(Перечисления.СтатусыСпецификаций.Запрещённая);

СебестоимостьПартииВсего = 0;
СумСкладВсего = 0;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯчейкиКомплектацииСрезПоследних.МПЗ КАК МПЗ,
	|	ЯчейкиКомплектацииСрезПоследних.МестоХранения КАК МестоХранения,
	|	ЯчейкиКомплектацииСрезПоследних.КоличествоЯчеек КАК КоличествоЯчеек,
	|	ЯчейкиКомплектацииСрезПоследних.КоличествоВЯчейке КАК КоличествоВЯчейке,
	|	ЯчейкиКомплектацииСрезПоследних.МПЗ.Наименование КАК Наименование,
	|	ЯчейкиКомплектацииСрезПоследних.ТочкаЗаказа КАК ТочкаЗаказа
	|ИЗ
	|	РегистрСведений.ЯчейкиКомплектации.СрезПоследних(&НаДату, ) КАК ЯчейкиКомплектацииСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПО ЯчейкиКомплектацииСрезПоследних.МПЗ = СтатусыМПЗСрезПоследних.МПЗ
	|ГДЕ
	|	СтатусыМПЗСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыМПЗ.Запрещённая)
	|	И СтатусыМПЗСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Запрещённая)
	|	И ЯчейкиКомплектацииСрезПоследних.КоличествоЯчеек <> 0
	|	И ЯчейкиКомплектацииСрезПоследних.КоличествоВЯчейке <> 0";
	Если СписокМестХранения.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ЯчейкиКомплектацииСрезПоследних.МестоХранения В ИЕРАРХИИ(&СписокМестХранения)";
	Запрос.УстановитьПараметр("СписокМестХранения",СписокМестХранения);
	КонецЕсли;
		Если СписокМПЗ.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ЯчейкиКомплектацииСрезПоследних.МПЗ В ИЕРАРХИИ(&СписокМПЗ)";
		Запрос.УстановитьПараметр("СписокМПЗ",СписокМПЗ);
		КонецЕсли;		
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО МестоХранения,Наименование";
Запрос.Текст = Запрос.Текст + " ИТОГИ ПО МестоХранения";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМестаХранения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМестаХранения.Следующий() Цикл
	флНовыйСклад = Истина;
	ЗапросПП = Новый Запрос;

	ЗапросПП.Текст = 
		"ВЫБРАТЬ
		|	ПередачиВПроизводствоОстатки.МПЗ,
		|	ПередачиВПроизводствоОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ПередачиВПроизводство.Остатки(&НаДату, ) КАК ПередачиВПроизводствоОстатки
		|ГДЕ
		|	ПередачиВПроизводствоОстатки.Документ.Линейка.МестоХраненияКанбанов = &МестоХранения";
	ЗапросПП.УстановитьПараметр("МестоХранения", ВыборкаМестаХранения.МестоХранения);
	ЗапросПП.УстановитьПараметр("НаДату", ТекущаяДата());
	РезультатЗапроса = ЗапросПП.Выполнить();
	ВыборкаПП = РезультатЗапроса.Выбрать();

	ВыборкаМПЗ = ВыборкаМестаХранения.Выбрать();
		Пока ВыборкаМПЗ.Следующий() Цикл
			Если ВидМПЗ = 1 Тогда
				Если ТипЗнч(ВыборкаМПЗ.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
				Продолжить;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ВыборкаМПЗ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
				Продолжить;
				КонецЕсли;
					Если СписокПодразделений.Количество() > 0 Тогда	
						Если СписокПодразделений.НайтиПоЗначению(ВыборкаМПЗ.МПЗ.Канбан.Подразделение) = Неопределено Тогда
						Продолжить;
						КонецЕсли;									
					КонецЕсли; 
			КонецЕсли; 
		КолСклад = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(ВыборкаМестаХранения.МестоХранения,ВыборкаМПЗ.МПЗ);
		КолПП = 0;
		ВыборкаПП.Сбросить();
			Пока ВыборкаПП.НайтиСледующий(Новый Структура("МПЗ",ВыборкаМПЗ.МПЗ)) Цикл
			КолПП = КолПП + ВыборкаПП.КоличествоОстаток;
			КонецЦикла; 
		КолПолныхЯчеек = ?(ВыборкаМПЗ.КоличествоВЯчейке > 0,Цел((КолСклад + КолПП)/ВыборкаМПЗ.КоличествоВЯчейке),0);
			Если ТолькоПустыеЯчейкиКомплектации Тогда	
				Если КолПолныхЯчеек > 0 Тогда
				Продолжить;
				КонецЕсли; 			
			КонецЕсли;
				Если ПоловинаКомплектации Тогда
					Если ВыборкаМПЗ.КоличествоЯчеек*ВыборкаМПЗ.КоличествоВЯчейке/2 <= КолСклад Тогда
					Продолжить;
					КонецЕсли; 
				КонецЕсли;
			Если ВыборкаМПЗ.КоличествоЯчеек*ВыборкаМПЗ.КоличествоВЯчейке/2 <= КолСклад Тогда
				Если флНовыйСклад Тогда
				ОблМестоХранения.Параметры.МестоХранения = ВыборкаМестаХранения.МестоХранения;
				ТабДок.Вывести(ОблМестоХранения);
				флНовыйСклад = Ложь;
				КонецЕсли; 
			ОблМПЗ.Параметры.Наименование = СокрЛП(ВыборкаМПЗ.МПЗ.Наименование);
			ОблМПЗ.Параметры.МПЗ = ВыборкаМПЗ.МПЗ;
			ОблМПЗ.Параметры.Статус = ПолучитьСтатус(ВыборкаМПЗ.МПЗ,ТекущаяДата());
				Если ТипЗнч(ВыборкаМПЗ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
				ОблМПЗ.Параметры.ГруппаПоЗакупкам = ВыборкаМПЗ.МПЗ.ГруппаПоЗакупкам;
				КонецЕсли;
			ОблМПЗ.Параметры.КолЯчеек = ВыборкаМПЗ.КоличествоЯчеек;
			ОблМПЗ.Параметры.КолВЯчейке = ВыборкаМПЗ.КоличествоВЯчейке;
			ОблМПЗ.Параметры.ТочкаЗаказа = ВыборкаМПЗ.ТочкаЗаказа;
				Если ВыбВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты Тогда
				Себестоимость = РегистрыСведений.Себестоимость.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Номенклатура,Подразделение",ВыборкаМПЗ.МПЗ,ВыборкаМПЗ.МПЗ.Канбан.Подразделение)).СебестоимостьПолная;
				ОблМПЗ.Параметры.Себестоимость = Себестоимость;
				ОблМПЗ.Параметры.СебестоимостьПартии = Себестоимость*ВыборкаМПЗ.КоличествоВЯчейке*ВыборкаМПЗ.КоличествоЯчеек;
				Иначе
				Себестоимость = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ВыборкаМПЗ.МПЗ,ТекущаяДата());
				ОблМПЗ.Параметры.Себестоимость = Себестоимость;
				ОблМПЗ.Параметры.СебестоимостьПартии = Себестоимость*ВыборкаМПЗ.КоличествоВЯчейке*ВыборкаМПЗ.КоличествоЯчеек;
				КонецЕсли; 
			ОблМПЗ.Параметры.КолСклад = КолСклад;
			ОблМПЗ.Параметры.СумСклад = КолСклад*Себестоимость; 
			ОблМПЗ.Параметры.КолПП = КолПП;
			ОблМПЗ.Параметры.КолВсего = КолСклад + КолПП;			
			ОблМПЗ.Параметры.КолПолныхЯчеек = КолПолныхЯчеек;
			ТекОбл = ТабДок.Вывести(ОблМПЗ);
				Если КолПолныхЯчеек > ВыборкаМПЗ.КоличествоЯчеек Тогда
				ТабДок.Область(ТекОбл.Верх, 12, ТекОбл.Низ, 12).ЦветФона = WebЦвета.Красный;
				КонецЕсли; 
			СебестоимостьПартииВсего = СебестоимостьПартииВсего + Себестоимость*ВыборкаМПЗ.КоличествоВЯчейке*ВыборкаМПЗ.КоличествоЯчеек;	
			СумСкладВсего = СумСкладВсего + КолСклад*Себестоимость;	
			Иначе
				Если флНовыйСклад Тогда
				ОблМестоХранения.Параметры.МестоХранения = ВыборкаМестаХранения.МестоХранения;
				ТабДок.Вывести(ОблМестоХранения);
				флНовыйСклад = Ложь;
				КонецЕсли;
			ОблМПЗ_МенееПоловины.Параметры.Наименование = СокрЛП(ВыборкаМПЗ.МПЗ.Наименование);
			ОблМПЗ_МенееПоловины.Параметры.МПЗ = ВыборкаМПЗ.МПЗ;
			ОблМПЗ_МенееПоловины.Параметры.Статус = ПолучитьСтатус(ВыборкаМПЗ.МПЗ,ТекущаяДата());
			ОблМПЗ_МенееПоловины.Параметры.КолЯчеек = ВыборкаМПЗ.КоличествоЯчеек;
			ОблМПЗ_МенееПоловины.Параметры.КолВЯчейке = ВыборкаМПЗ.КоличествоВЯчейке;
			ОблМПЗ_МенееПоловины.Параметры.ТочкаЗаказа = ВыборкаМПЗ.ТочкаЗаказа;
				Если ТипЗнч(ВыборкаМПЗ.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
				Себестоимость = РегистрыСведений.Себестоимость.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Номенклатура,Подразделение",ВыборкаМПЗ.МПЗ,ВыборкаМПЗ.МПЗ.Канбан.Подразделение)).СебестоимостьПолная;
				ОблМПЗ_МенееПоловины.Параметры.Себестоимость = Себестоимость;
				ОблМПЗ_МенееПоловины.Параметры.СебестоимостьПартии = Себестоимость*ВыборкаМПЗ.КоличествоВЯчейке*ВыборкаМПЗ.КоличествоЯчеек;
				Иначе
				Себестоимость = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ВыборкаМПЗ.МПЗ,ТекущаяДата());
				ОблМПЗ_МенееПоловины.Параметры.Себестоимость = Себестоимость;
				ОблМПЗ_МенееПоловины.Параметры.СебестоимостьПартии = Себестоимость*ВыборкаМПЗ.КоличествоВЯчейке*ВыборкаМПЗ.КоличествоЯчеек;
				КонецЕсли; 
			ОблМПЗ_МенееПоловины.Параметры.КолСклад = КолСклад;
			ОблМПЗ_МенееПоловины.Параметры.СумСклад = КолСклад*Себестоимость;
			ОблМПЗ_МенееПоловины.Параметры.КолПП = КолПП;
			ОблМПЗ_МенееПоловины.Параметры.КолВсего = КолСклад + КолПП; 
			ОблМПЗ_МенееПоловины.Параметры.КолПолныхЯчеек = КолПолныхЯчеек;
			ТекОбл = ТабДок.Вывести(ОблМПЗ_МенееПоловины);
				Если КолПолныхЯчеек > ВыборкаМПЗ.КоличествоЯчеек Тогда
				ТабДок.Область(ТекОбл.Верх, 12, ТекОбл.Низ, 12).ЦветФона = WebЦвета.Красный;
				КонецЕсли;
			СебестоимостьПартииВсего = СебестоимостьПартииВсего + Себестоимость*ВыборкаМПЗ.КоличествоВЯчейке*ВыборкаМПЗ.КоличествоЯчеек;
			СумСкладВсего = СумСкладВсего + КолСклад*Себестоимость;		
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
ОблКонец.Параметры.СебестоимостьПартии = СебестоимостьПартииВсего;
ОблКонец.Параметры.СумСклад = СумСкладВсего;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 4;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
	Если Отчет.ИнтервалОбновления > 0 Тогда
	ПодключитьОбработчикОжидания("СформироватьОтчет", Отчет.ИнтервалОбновления*60);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидМПЗ = 1;
КонецПроцедуры

&НаСервере
Функция НастройкиНаСервере()
Настройки = Новый Структура("СписокПодразделений,СписокМПЗ,ВидМПЗ",СписокПодразделений,СписокМПЗ,ВидМПЗ);
Возврат(Новый Структура("КлючНазначенияИспользования,Настройки","НаличиеКомплектацииНаЛинейках",Настройки));
КонецФункции

&НаКлиенте
Процедура Настройки(Команда)
Результат = ОткрытьФормуМодально("ОбщаяФорма.НастройкиФорм",НастройкиНаСервере());
	Если Результат <> Неопределено Тогда	
	СписокПодразделений = Результат.СписокПодразделений;
	СписокМПЗ = Результат.СписокМПЗ;
	ВидМПЗ = Результат.ВидМПЗ;	
	КонецЕсли;
КонецПроцедуры
